/*
1.Задача на взаимодействие между классами. Разработать систему «Вступительные экзамены».
    Абитуриент регистрируется на Факультет, сдает Экзамены. Преподаватель выставляет Оценку.
    Система подсчитывает средний бал и определяет Абитуриента, зачисленного в учебное заведение.
    2.Компьютер загадывает число от 1 до n. У пользователя k попыток отгадать.
    После каждой неудачной попытки компьютер сообщает меньше или больше загаданное число.
    В конце игры текст с результатом (или “Вы угадали”, или “Попытки закончились”).
    3.Найти количество различных элементов массива. Пример: для 1 4 5 1 1 3 ответ 4.
    4.Дан файл  с логинами и паролями. Найдите топ10 самых популярных паролей.
    5.Ход коня по шахматной доске
    Вводиться текущее положение коня и клетка в которую пробуют его передвинуть

 */

public class Main {
    public static void main(String[] args) {

    }
}
